Revit 2027 API
BuiltInFailures.PlanRegionFailures Class
 Failures about PlanRegion.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PlanRegionFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class PlanRegionFailures
Public NotInheritable Class PlanRegionFailures
public ref class PlanRegionFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type PlanRegionFailures = class end
The BuiltInFailures.PlanRegionFailures type exposes the following members.
Properties
Name | Description
DeletedViewRangeLevel |  Deleted level was used to define plan region's view range.\r\nReplace deleted level by level of parent view and adjust offset?
Intersecting |  The boundaries of the highlighted Plan Regions overlap.
InvalidPlanRegion |  Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.
InvalidPlanRegionError |  Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.
Nested |  Cannot have nested Plan Regions.
Top
See Also
Reference
Autodesk.Revit.DB Namespace